{
    "undetected_infections": {
        "description": "Undetected infections",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 0.83,
        "minValue": 0,
        "maxValue": 0.99,
        "stepValue": 0.001,
        "unitsDescriptor": "%",
        "isInteger": false,
        "isPercentage": true,
        "longformDescription": "Percentage of infections which are not recorded as 'confirmed case'.",
        "longformDoNotConfuseWith": "",
        "longformEffects": "This parameter affects historical estimates. It acts like a multiplier to confirmed case counts, which we get from data. These adjusted case counts are used to estimate the number of infected in historical estimates.<br><br>This parameter does not affect model predictions (other than indirectly; the last known historical state is given to the model as the initial state).",
        "longformDefaultValueJustification": "This number is very contentious. It is difficult to measure, and different experts have given wildly different estimates for this. It also has huge implications for hospitalization and fatality rates, although in our model those have been separated onto their own parameter sliders (as opposed to being derived from this parameter value, other parameter values, assumptions and data)."
    },
    "unrecorded_deaths": {
        "description": "Unrecorded deaths",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 0.2,
        "minValue": 0,
        "maxValue": 0.99,
        "stepValue": 0.001,
        "unitsDescriptor": "%",
        "isInteger": false,
        "isPercentage": true,
        "longformDescription": "Percentage of deaths which were caused by COVID-19, but were not counted in the official statistics.",
        "longformDoNotConfuseWith": "This parameter affects historical estimates. It acts like a multiplier to confirmed death counts, which we get from data.<br><br>This parameter does not affect model predictions (although deaths are shown as cumulative, so any deaths accrued during historical estimates do carry over into cumulative death counts at model predictions side).",
        "longformEffects": "",
        "longformDefaultValueJustification": "A significant number of COVID-19 deaths had been hidden from the official statistics.<sup>[1]</sup> We have no idea what the true percentage of unrecorded deaths is.<br><br>https://yle.fi/uutiset/3-11310966"
    },
    "days_from_incubation_to_infectious": {
        "description": "Length of incubation period {Tinc}",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 4.0,
        "minValue": 0.15,
        "maxValue": 24,
        "stepValue": 0.0001,
        "unitsDescriptor": "days",
        "isInteger": false,
        "isPercentage": false,
        "longformDescription": "In our model, incubation period refers to the time between being infected and becoming infectious.",
        "longformDoNotConfuseWith": "Often this term is used to refer to the time between being infected and becoming symptomatic. This is not the case here.",
        "longformEffects": "This parameter affects historical estimates.<br><br>This parameter affects model predictions.",
        "longformDefaultValueJustification": "We assume that patients become infectious on average one day before they start showing symptoms. Therefore, length of the incubation period here should be slightly less than what is believed to be the time period from infection to showing symptoms."
    },
    "days_from_infectious_to_not_infectious": {
        "description": "Duration patient is infectious {Tinf}",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 2,
        "minValue": 0.1,
        "maxValue": 24,
        "stepValue": 0.01,
        "unitsDescriptor": "days",
        "isInteger": false,
        "isPercentage": false,
        "longformDescription": "Average number of days a patient is infectious.",
        "longformDoNotConfuseWith": "Note that in our model a patient is considered to be non-infectious after they isolate to either home or hospital. Therefore, this parameter should be set to a value which is less than the number of days that a patient is physically able to spread the virus (a patient may be physically able to spread the virus by coughing, but if they are coughing at home, they are considered to be non-infectious in our model).",
        "longformEffects": "This parameter affects historical estimates.<br><br>This parameter affects model predictions.",
        "longformDefaultValueJustification": "Some people will never develop symptoms and they will infect other people for a long time. Some people will develop symptoms fast and isolate fast. Some people become infectious before developing symptoms, and after developing syptoms they may still be interacting in the community for a short while, until they isolate themselves. On average we believe patients will be infectious about 1 day without symptoms and about 1 day after symptoms, yielding the default value 2. This parameters is very contentious and we do not have good references for our choice of a default value."
    },
    "fatality_rate": {
        "description": "Infection fatality rate",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 0.0075,
        "minValue": 0.001,
        "maxValue": 0.05,
        "stepValue": 0.0001,
        "unitsDescriptor": "%",
        "isInteger": false,
        "isPercentage": true,
        "longformDescription": "Percentage of fatalities from all infections (including undiagnosed infections).",
        "longformDoNotConfuseWith": "Newspapers often refer to <i>case</i> fatality rate, which sometimes refer to percentage of fatalities from confirmed cases, and sometimes to percentage of fatalities from closed cases. In the original Epidemic Calculator this parameter was titled 'case fatality rate', but it was in fact referring to infection fatality rate (confirmed cases are not plotted in neither Epidemic Calculator nor Corosim). ",
        "longformEffects": "This parameter does not affect historical estimates.<br><br>This parameter affects model predictions.",
        "longformDefaultValueJustification": "https://www.medrxiv.org/content/10.1101/2020.05.03.20089854v1"
    },
    "days_in_hospital": {
        "description": "Length of hospital stay",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 11.6,
        "minValue": 0.1,
        "maxValue": 100,
        "stepValue": 0.01,
        "unitsDescriptor": "days",
        "isInteger": false,
        "isPercentage": false,
        "longformDescription": "Average number of days in hospital or ICU (excluding population who spend 0 days in hospital).",
        "longformDoNotConfuseWith": "In the original Epidemic Calculator, length of hospital stay affected only those patients who eventually survived, not those who eventually died. In Corosim this slider affects all hospitalizations. Also note that our model has some simplifying assumptions related to ICU; this parameter affects both regular ward and ICU stay, and ICU is modeled as an alternative track to regular ward, in comparison to reality, where patients typically go to ICU after first spending time in regular ward.",
        "longformEffects": "This parameter affects the 'recovered' numbers in historical estimates. However, it does not affect the hospitalization and ICU numbers in historical estimates, because we get those numbers from actual data (so we don't need to estimate them).<br><br>This parameter affects model predictions (hospitalized, icu and recoveries).",
        "longformDefaultValueJustification": "The Finnish Health Authority THL, in their first Coronavirus modelling related webinar, said that average hospitalization in regular ward in Finland was 8 days, 30% of those patients ended up in the ICU, and the ICU duration was 12 days. According to these numbers, the average length of hospital stay would be 8+0.3*12 = 11.6."
    },
    "days_in_mild_recovering_state": {
        "description": "Recovery time for mild cases",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 4,
        "minValue": 0.5,
        "maxValue": 100,
        "stepValue": 0.01,
        "unitsDescriptor": "days",
        "isInteger": false,
        "isPercentage": false,
        "longformDescription": "The average number of days a non-severe cases spends isolated in home.",
        "longformDoNotConfuseWith": "",
        "longformEffects": "This parameter affects historical estimates.<br><br>This parameter affects model predictions.",
        "longformDefaultValueJustification": "This value is very contentious, because we do not have good data on the proportion of asymptomatic cases, who spend 0 days isolated in home, thus dragging down the average."
    },
    "hospitalization_rate": {
        "description": "Hospitalization rate",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 0.014,
        "BEFORE YOU CHANGE DEFAULT VALUE, PLEASE READ THE LONG FORM DESCRIPTION!": true,
        "minValue": 0.001,
        "maxValue": 0.2,
        "stepValue": 0.0001,
        "unitsDescriptor": "%",
        "isInteger": false,
        "isPercentage": true,
        "longformDescription": "Hospitalization as a percentage of all infections. Includes ICU hospitalizations.",
        "longformDoNotConfuseWith": "In the original Epidemic Calculator there is a slider with the same name, but it actually affects only those hospitalizations who eventually survive. The true hospitalization rate in Epidemic Calculator is actually the displayed hospitalization rate plus infected fatality rate (which is labelled 'case fatality rate'). In other words, the parameter value was mislabeled. We could have resolved this in a few different ways. For example, we could have simply labelled the parameter value correctly ('hospitalization rate, excluding people who eventually die'). That would have been awkward for end users. Instead, we chose to to keep the parameter label simple ('Hospitalization rate') and make the displayed value conform to that description. So the value displayed to end users is hospitalization_rate_excluding_fatalities + fatality_rate. You can verify this by moving the fatality rate slider; you will notice that the hospitalization rate changes as well.",
        "longformEffects": "This parameter affects the 'recovered' numbers in historical estimates. However, it does not affect the hospitalization and ICU numbers in historical estimates, because we get those numbers from actual data (so we don't need to estimate them).<br><br>This parameter affects model predictions (hospitalized, icu and recoveries).",
        "longformDefaultValueJustification": "We can calculate the expected number of hospitalizations based on confirmed case counts. Using this default value (and the default values of other parameters), the expected number of hospitalizations roughly matches the actual hospitalization numbers released by THL. This analysis for performed with data which was available on 14.5.2020. For more information, we refer to source code and to our explanation of historical estimates."
    },
    "icu_rate_from_hospitalized": {
        "description": "ICU rate<br>(visualization only)",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 0.3,
        "minValue": 0,
        "maxValue": 1,
        "stepValue": 0.01,
        "unitsDescriptor": "%",
        "isInteger": false,
        "isPercentage": true,
        "longformDescription": "Percentage of ICU patients out of all hospitalizations.",
        "longformDoNotConfuseWith": "With regards to model predictions, ICU rate is not part of the core model. We added this as a small visualization to get 'ballpark' numbers. The core model does not segregate hospitalizations into regular ward and ICU patients. For example, if the core model predicts 1000 hospitalizations for a given day and ICU ratio is set to 30%, then we visualize the results by showing 700 in regular ward and 300 in ICU. This is equivalent to assuming that the 'ICU track' is an alternative track to 'regular ward track' and assuming that the length of ICU hospitalization is equivalent to length of regular ward hospitalization. In reality, ICU patients will typically visit the regular ward first, and the duration of their hospitalization will be longer than the duration of regular ward patients' hospitalization.",
        "longformEffects": "This parameter does not affect historical estimates.<br><br>This parameter affects model predictions (hospitalized, icu).",
        "longformDefaultValueJustification": "Given the assumptions described above, ICU ratio can be set to the observed ratio between active ICU patients and all active hospitalizations. The 30-day average for this ratio was 30% with the data that was available on 14.5.2020."
    },
    "icu_capacity": {
        "description": "ICU capacity<br>(visualization only)",
        "isDefaultValueAutomaticallyGeneratedFromData": false,
        "defaultValue": 700,
        "minValue": 0,
        "maxValue": 10000,
        "stepValue": 10,
        "unitsDescriptor": "",
        "isInteger": true,
        "isPercentage": false,
        "longformDescription": "This simply draws a horizontal line to help users visualize when ICU rate is exceeded. It only makes sense to draw this line under specific conditions. If you have trouble getting it visible, try to uncheck fatalities and infections, and then drag y axis zoom to a position where the line should be visible.",
        "longformDoNotConfuseWith": "",
        "longformEffects": "",
        "longformDefaultValueJustification": ""
    }
}
